
Функция РаспознатьСуммуЧека(АдресДвоичныхДанных) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДвоичныхДанных);
	
	Соединение = Новый HTTPСоединение(АдресСервераМашинногоЗрения(), 80);
	
	Запрос = Новый HTTPЗапрос("/checkSumm");
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);	
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка взаимодействия с сервисом машинного зрения";
	КонецЕсли;
	
	Возврат Число(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

Функция АдресСервераМашинногоЗрения()
	
	Возврат "localhost";
	
КонецФункции

