
Процедура ОткрытьФормуЧекаДляСотрудника(КодСотрудника) Экспорт
	
	Сотрудник = РаботаСЧекамиВызовСервера.НайтиСотрудникаПоКоду(КодСотрудника);
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сообщить(СтрШаблон("Сотрудник с кодом ""%1"" не найден", КодСотрудника));
		Возврат;
	КонецЕсли;	
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Сотрудник", Сотрудник);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Документ.ЧекЗаПитание.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
