
&НаКлиенте
Процедура СсылкаНаЧекНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Ответы = Новый СписокЗначений;
	Ответы.Добавить("Галерея");
	Ответы.Добавить("Камера");
	
	Ответ = Вопрос("Откуда взять картинку?", Ответы);
	
	Если Ответ = "Галерея" Тогда
		
		Оповещение = Новый ОписаниеОповещения("СсылкаНаЧекНажатиеЗавершение", ЭтотОбъект);
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
		ПараметрыДиалога.Фильтр = "Изображение|*.png;*.jpg";
		
		НачатьПомещениеФайлаНаСервер(Оповещение,,,, ПараметрыДиалога, УникальныйИдентификатор);
		
	ИначеЕсли Ответ = "Камера" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		
		ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок();
		СсылкаНаЧек = ПоместитьВоВременноеХранилище(ДанныеМультимедиа.ПолучитьДвоичныеДанные());
		
		#КонецЕсли
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаЧекНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	СсылкаНаЧек = Результат.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(СсылкаНаЧек) Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеКартинки = ПолучитьИзВременногоХранилища(СсылкаНаЧек);
	
	ТекущийОбъект.ФотоЧека = Новый ХранилищеЗначения(ДанныеКартинки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеКартинки = ТекущийОбъект.ФотоЧека.Получить();
	СсылкаНаЧек = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСерверНаСервере()
	
	Записать();
	
	Прокси = РаботаССервером.WSПроксиСервера();
	
	ХранилищеФото = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаЧек));
	
	Результат = Прокси.PostInvoice(Объект.Дата, ХранилищеФото);
	
	Если Не ПустаяСтрока(Результат) Тогда
		ВызватьИсключение Результат;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьНаСервер(Команда)
	ОтправитьНаСерверНаСервере();
КонецПроцедуры

