
&НаКлиенте
Процедура СсылкаНаЧекНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("СсылкаНаЧекНажатиеЗавершение", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Изображение|*.png;*.jpg";
	
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаЧекНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	СсылкаНаЧек = Результат.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(СсылкаНаЧек) Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеКартинки = ПолучитьИзВременногоХранилища(СсылкаНаЧек);
	
	ТекущийОбъект.ФотоЧека = Новый ХранилищеЗначения(ДанныеКартинки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеКартинки = ТекущийОбъект.ФотоЧека.Получить();
	СсылкаНаЧек = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуЧека(СсылкаНаЧек)
	ИнтеграцияМашинноеЗрение.РаспознатьСуммуЧека(СсылкаНаЧек);
КонецФункции

&НаКлиенте
Процедура Распознать(Команда)
	
	Если Не ЗначениеЗаполнено(СсылкаНаЧек) Тогда
		Сообщить("Для распознавание суммы загрузите картинку чека");
		Возврат;
	КонецЕсли;
	
	Объект.Сумма = ПолучитьСуммуЧека(СсылкаНаЧек);
	
КонецПроцедуры

